Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudtrail_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudtrail_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSCloudTrailAclCheck"

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSCloudTrailWrite"

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/posts/*",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyUnencryptedObjectUploads"

          + condition {
              + test     = "StringNotEquals"
              + values   = [
                  + "AES256",
                ]
              + variable = "s3:x-amz-server-side-encryption"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:DeleteObjectTagging",
              + "s3:PutObject",
              + "s3:PutObjectTagging",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyIfNotFromOurOrg"

          + condition {
              + test     = "ArnNotEqualsIfExists"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }
          + condition {
              + test     = "StringNotEqualsIfExists"
              + values   = [
                  + "o-4uer5s3xlw",
                ]
              + variable = "aws:PrincipalOrgID"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudtrail.media_trail will be updated in-place
~ resource "aws_cloudtrail" "media_trail" {
        id                            = "arn:aws:cloudtrail:us-east-2:390402544450:trail/wutopia-media-trail"
        name                          = "wutopia-media-trail"
      ~ s3_bucket_name                = "prod-wrestleutopia-media-bucket-trail-1b98b4" -> (known after apply)
        tags                          = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.cloudtrail_logs must be replaced
-/+ resource "aws_s3_bucket" "cloudtrail_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::prod-wrestleutopia-media-bucket-trail-1b98b4" -> (known after apply)
      ~ bucket                      = "prod-wrestleutopia-media-bucket-trail-1b98b4" -> "prod-wrestleutopia-media-bucket-trail" # forces replacement
      ~ bucket_domain_name          = "prod-wrestleutopia-media-bucket-trail-1b98b4.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "us-east-2" -> (known after apply)
      ~ bucket_regional_domain_name = "prod-wrestleutopia-media-bucket-trail-1b98b4.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "prod-wrestleutopia-media-bucket-trail-1b98b4" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "7536c56f1712575d67d27d3c89c97f159cdc0b99f4967bd93c0e4e0567774d8f" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.cloudtrail_logs will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "cloudtrail_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "trail-compliance-7y"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2555
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "AWSLogs/"
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }
    }

  # aws_s3_bucket_ownership_controls.cloudtrail_logs will be created
+ resource "aws_s3_bucket_ownership_controls" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.cloudtrail_logs will be created
+ resource "aws_s3_bucket_policy" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/*",
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket/posts/*",
                        ]
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket",
                        ]
                      - Sid       = "DenyInsecureTransport"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringNotEquals = {
                              - "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "DenyUnencryptedObjectUploads"
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectTagging",
                          - "s3:PutObject",
                          - "s3:DeleteObjectTagging",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Condition = {
                          - ArnNotEqualsIfExists    = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                          - StringNotEqualsIfExists = {
                              - "aws:PrincipalOrgID" = "o-4uer5s3xlw"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "DenyIfNotFromOurOrg"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.cloudtrail_logs will be created
+ resource "aws_s3_bucket_public_access_block" "cloudtrail_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.cloudtrail_logs will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "cloudtrail_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # random_id.trail will be destroyed
  # (because random_id.trail is not in configuration)
- resource "random_id" "trail" {
      - b64_std     = "G5i0" -> null
      - b64_url     = "G5i0" -> null
      - byte_length = 3 -> null
      - dec         = "1808564" -> null
      - hex         = "1b98b4" -> null
      - id          = "G5i0" -> null
    }

Plan: 6 to add, 3 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 6 to add, 3 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```